# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "localstack/tap"
tap "sst/tap"

# Binaries
brew "zsh" # UNIX shell (command interpreter)
brew "coreutils" # GNU File, Shell, and Text utilities
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "telnet" # TCP/IP client for accessing remote services
brew "fastfetch" # Fast, highly customisable system info script
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "dust" # More intuitive version of du in rust
brew "eza" # Modern, maintained replacement for ls
brew "fd" # Simple, fast and user-friendly alternative to find
brew "fzf" # Command-line fuzzy finder written in Go
brew "zoxide" # Shell extension to navigate your filesystem faster
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "tmux" # Terminal multiplexer
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "jq" # Lightweight and flexible command-line JSON processor
brew "yq" # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "thefuck" # Programmatically correct mistyped console commands
brew "tlrc" # tldr-pages is a collection of community-maintained help pages for command-line tools
brew "mcfly" # Fly through your shell history
brew "mas" # Mac App Store command line interface
brew "btop" # Resource monitor. C++ version and continuation of bashtop and bpytop
brew "stow" # Symlink manager for dotfiles
brew "yt-dlp" # A feature-rich command-line audio/video downloader

# Zsh plugins
brew "zsh-autosuggestions" # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-completions" # Additional completion definitions for zsh

# Development tools
brew "go" # Go programming language
brew "neovim" # Ambitious Vim-fork focused on extensibility and agility
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "pinentry-mac" # Pinentry for GPG on Mac
brew "pre-commit" # Framework for managing multi-language pre-commit hooks
brew "gh" # GitHub CLI
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "git-secrets" # Additional git secrets protection
brew "gitleaks" # Git secrets scanner for detecting hardcoded secrets
brew "yamllint"	# YAML linter
brew "shellcheck"	# Shell script linter
brew "bats-core" # Bash testing framework
brew "renovate"	# Dependency updates
brew "yarn" # JavaScript package manager
brew "fnm" # Fast and simple Node.js version manager
brew "pnpm" # Fast, disk space efficient package manager
brew "postgresql" # PostgreSQL C client library
brew "libpq" # PostgreSQL C client library
brew "sqlite" # SQLite is a C-language library SQL database engine
brew "pipx" # Execute binaries from Python packages in isolated environments
brew "pyenv" # Simple Python version management
brew "docker" # Pack, ship and run any application as a lightweight container
brew "docker-compose" # Isolated development environments using Docker
brew "hadolint"	# Dockerfile linter
brew "cosign" # Container Signing
brew "age" # Simple, modern, secure file encryption
brew "sops" # Simple and flexible tool for managing secrets
brew "awscli" # Universal Command Line Interface for Amazon Web Services
brew "aws-sso-util" # AWS SSO utility
brew "azure-cli" # Azure management 
cask "google-cloud-sdk"	# GCP management

# Kubernetes tools
brew "kubernetes-cli" # Kubernetes command-line interface
brew "minikube" # Run a Kubernetes cluster locally
brew "helm" # Kubernetes package manager
brew "trivy" # Vulnerability scanner for container images, file systems, and Git repos
brew "k9s" # Kubernetes CLI To Manage Your Clusters In Style!
brew "kubecolor" # Colorize your kubectl output
brew "dyff" # δyƒƒ /ˈdʏf/ - A diff tool for YAML files, and sometimes JSON
brew "argocd" # Declarative continuous deployment for Kubernetes
brew "kubeseal" # Kubernetes controller and tool for one-way encrypted Secrets
cask "openlens" # OpenLens Kubernetes IDE

# Terraform tools
brew "tenv" # OpenTofu / Terraform / Terragrunt / Terramate / Atmos version manager
brew "checkov" # Prevent cloud misconfigurations during build-time for IaC tools
brew "terraform-docs" # Tool to generate documentation from Terraform modules
brew "terrascan" # Detect compliance and security violations across Infrastructure as Code
brew "tflint" # Linter for Terraform files
brew "tfsec" # Static analysis security scanner for your terraform code
brew "tfupdate" # Update version constraints in your Terraform configurations
brew "infracost" # Cloud cost estimates for Terraform projects
brew "localstack/tap/localstack-cli" # LocalStack CLI

# AI tools
brew "sst/tap/opencode" # The AI coding agent built for the terminal.
brew "gemini-cli" # Gemini CLI
cask "cursor" # Cursor is a AI-powered IDE for developers.
cask "cursor-cli" # CLI for Cursor, the AI-powered code editor.
cask "claude-code" # Claude Code (claude.ai/code) is a development environment for AI agents.
cask "warp" # Blazingly fast, Rust-based terminal with AI features
cask "visual-studio-code" # IDE redefined and optimised for building and debugging modern web and cloud applications
cask "antigravity" # Antigravity is Google AI-powered IDE for developers.

# Apps
cask "1password" # Password manager to store and manage your passwords securely
cask "firefox" # Web browser focused on privacy and security
cask "cloudflare-warp" # Free app that makes your Internet safer
cask "raycast" # Fast, efficient alternative to Spotlight
cask "stats" # System monitor for the menu bar
cask "ghostty" # Terminal emulator that uses platform-native UI and GPU acceleration
cask "slack" # Team communication and collaboration tool
cask "discord" # Chat platform for communities and teams
cask "docker-desktop" # App to build and share containerised applications and microservices
cask "notion" # App to write, plan, collaborate, and get organised
cask "notion-calendar" # Notion calendar App to manage your time and work
cask "tidal" # Music streaming service
cask "logi-options+" # Logitech Options+
cask "focusrite-control" # Focusrite Control
cask "flameshot" # Screenshot tool - Fixed https://github.com/flameshot-org/flameshot/issues/3572#issuecomment-2710329826

# Fonts
cask "font-meslo-lg-nerd-font"

# Mac App Store
mas "Xcode", id: 497799835

# VSCode extensions
vscode "aaron-bond.better-comments"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "cedricverlinden.cursor-dark"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "oderwat.indent-rainbow"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sidthesloth.html5-boilerplate"
vscode "usernamehw.errorlens"
vscode "xabikos.javascriptsnippets"
vscode "zainchen.json"
