# Taps
tap "homebrew/cask"
tap "homeport/tap"
tap "sst/tap"

# Binaries
brew "zsh" # UNIX shell (command interpreter)
brew "coreutils" # GNU File, Shell, and Text utilities
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "neofetch" # Fast, highly customisable system info script
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "dust" # More intuitive version of du in rust
brew "eza" # Modern, maintained replacement for ls
brew "fd" # Simple, fast and user-friendly alternative to find
brew "fzf" # Command-line fuzzy finder written in Go
brew "zoxide" # Shell extension to navigate your filesystem faster
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "tmux" # Terminal multiplexer
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "jq" # Lightweight and flexible command-line JSON processor
brew "yq" # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "thefuck" # Programmatically correct mistyped console commands
brew "tlrc" # tldr-pages is a collection of community-maintained help pages for command-line tools
brew "mcfly" # Fly through your shell history
brew "mas" # Mac App Store command line interface
brew "btop" # Resource monitor. C++ version and continuation of bashtop and bpytop
brew "stow" # Symlink manager for dotfiles

# Zsh plugins
brew "zsh-autosuggestions" # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-completions" # Additional completion definitions for zsh

# Development tools
brew "neovim" # Ambitious Vim-fork focused on extensibility and agility
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "pinentry-mac" # Pinentry for GPG on Mac
brew "pre-commit" # Framework for managing multi-language pre-commit hooks
brew "git-secrets" # Additional git secrets protection
brew "gitleaks" # Git secrets scanner for detecting hardcoded secrets
brew "yamllint"	# YAML linter
brew "shellcheck"	# Shell script linter
brew "bats-core" # Bash testing framework
brew "renovate"	# Dependency updates
brew "fnm" # Fast and simple Node.js version manager
brew "pyenv" # Simple Python version management
brew "docker" # Pack, ship and run any application as a lightweight container
brew "docker-compose" # Isolated development environments using Docker
brew "hadolint"	# Dockerfile linter
brew "cosign" # Container Signing
brew "age" # Simple, modern, secure file encryption
brew "sops" # Simple and flexible tool for managing secrets
brew "awscli" # Universal Command Line Interface for Amazon Web Services
brew "azure-cli" # Azure management 
cask "google-cloud-sdk"	# GCP management

# Kubernetes tools
brew "kubernetes-cli" # Kubernetes command-line interface
brew "minikube" # Run a Kubernetes cluster locally
brew "helm" # Kubernetes package manager
brew "trivy" # Vulnerability scanner for container images, file systems, and Git repos
brew "k9s" # Kubernetes CLI To Manage Your Clusters In Style!
brew "kubecolor" # Colorize your kubectl output
brew "dyff" # δyƒƒ /ˈdʏf/ - A diff tool for YAML files, and sometimes JSON

# Terraform tools
brew "tenv" # OpenTofu / Terraform / Terragrunt / Terramate / Atmos version manager
brew "checkov" # Prevent cloud misconfigurations during build-time for IaC tools
brew "terraform-docs" # Tool to generate documentation from Terraform modules
brew "terrascan" # Detect compliance and security violations across Infrastructure as Code
brew "tflint" # Linter for Terraform files
brew "tfsec" # Static analysis security scanner for your terraform code
brew "tfupdate" # Update version constraints in your Terraform configurations
brew "infracost" # Cloud cost estimates for Terraform projects

# AI tools
brew "fabric-ai" # Open-source framework for augmenting humans using AI
brew "sst/tap/opencode" # The AI coding agent built for the terminal.

# Apps
cask "1password" # Password manager to store and manage your passwords securely
cask "firefox" # Web browser focused on privacy and security
cask "cloudflare-warp" # Free app that makes your Internet safer
cask "raycast" # Fast, efficient alternative to Spotlight
cask "stats" # System monitor for the menu bar
cask "ghostty" # Terminal emulator that uses platform-native UI and GPU acceleration
cask "warp" # Blazingly fast, Rust-based terminal with AI features
cask "slack" # Team communication and collaboration tool
cask "discord" # Chat platform for communities and teams
cask "docker-desktop" # App to build and share containerised applications and microservices
cask "visual-studio-code" # Code editor redefined and optimised for building and debugging modern web and cloud applications
cask "cursor" # AI-powered code editor
cask "notion" # App to write, plan, collaborate, and get organised
cask "notion-calendar" # Notion calendar App to manage your time and work
cask "flameshot" # Screenshot software
cask "freelens" # Kubernetes IDE

# Fonts
cask "font-meslo-lg-nerd-font"
